test/artillery.yml
# Just the example (didn't get the couple prelim tries I made to work [so I just put the example back in here])
  config:
    target: "ws://localhost:3001"
    phases:
      - duration: 20
        arrivalRate: 10
    ws:
      # Ignore SSL certificate errors
      # - useful in *development* with self-signed certs
      rejectUnauthorized: false
 scenarios:
   - engine: "socketio"
     flow:
       - emit:
           channel: "echo"
           data: "hello"
           response:
             channel: "echoed"
             data: "hello"
       - emit:
           channel: "echo"
           data: "world"
           response:
             channel: "echoed"
             data: "world"
       - think: 1
       - emit:
           channel: "echo"
           data: "do not care about the response"
       - emit:
           channel: "echo"
           data: "still do not care about the response"
       - think: 1