test/artillery1.yml
# Just the example (didn't get the couple prelim tries I made to work [so I just put the example back in here])

config:
  target: "https://35.160.138.139:3001"
  http:
      tls:
        rejectUnauthorized: false
  phases:
    - duration: 10
      arrivalRate: 1
    - duration: 10
      arrivalRate: 5
  variables:
    greeting: ["hello", "goedemorgen", "добрый день", "guten tag", "bonjour", "hola"]
#  processor: "./functions.js"

scenarios:
  - name: "A user that just lurks"
#    weight: 75
    engine: "socketio"
    query:
        peer: "peer1"
        connId: "123"
        stage: "initiator"
    flow:
      - get:
          url: "/"
#      - emit:
#          channel: "add user"
#          data: "lurker-{{$randomString()}}"
      - think: 60

#  - name: "A mostly quiet user"
#    weight: 15
#    engine: "socketio"
#    flow:
#      - get:
#          url: "/"
#      - emit:
#          channel: "add user"
#          data: "quiet-{{ $randomString() }}"
#      - think: 5
#      - emit:
#          channel: "new message"
#          data: "{{ greeting }}"
#      - think: 60
#
#  - name: "A chatty user"
#    weight: 10
#    engine: "socketio"
#    flow:
#      - get:
#          url: "/"
#      - emit:
#          channel: "add user"
#          data: "chatty-{{ $randomString() }}"
#      - emit:
#          channel: "new message"
#          data: "{{ greeting }}"
#      - loop:
#          - function: "setMessage"
#          - emit:
#              channel: "new message"
#              data: "{{ connId }}"
#          - think: 10
#        count: 10
#      - think: 60